# 06 - Add/Remove Rows and Columns From DataFrames

https://youtu.be/HQ6XO9eT-fc?si=6STRvIlEn1b-zwp8

Notes by [Innovinitylabs](https://github.com/innovinitylabs)

In [120]:
import pandas as pd

#Setup for learning data

people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}
dft = pd.DataFrame(people)

---

#Setup for Real world data

In [121]:
# df = pd.read_csv('data/survey_results_public.csv', index_col='Respondent' )
# schema_df = pd.read_csv('data/survey_results_schema.csv', index_col='Column')
# pd.set_option('display.max_columns', 85)

In [122]:
# pd.set_option('display.max_rows', 85)

---
---
---

#### Adding and removing columns

Combining two columns into one

In [123]:
dft['first'] + ' ' + dft['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

 can assign and create a new column like this

In [124]:
dft['first_name'] = dft['first'] + ' ' + dft['last']
dft

   first     last                    email     first_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

to <mark>remove</mark> a column  
we have to use the `drop()` method on DataFrame  
###### [TimeStamp](https://youtu.be/HQ6XO9eT-fc?si=n4XTkr6gsG4xjlN9&t=184)

In [125]:
dft.drop(columns= ['first', 'last'])

                     email     first_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [126]:
dft

   first     last                    email     first_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

to make changes in place have to use  `inplace=True`

In [127]:
dft.drop(columns= ['first', 'last'], inplace=True)
dft

                     email     first_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

---
to <mark> create a new column from existing columns</mark>

In [128]:
dft['first_name'].str.split(' ')

0    [Corey, Schafer]
1         [Jane, Doe]
2         [John, Doe]
Name: first_name, dtype: object

we get first and last name in a list above. to assign this to two different columns we have to  expand `expand=True` this into two different columns like this

In [129]:
dft['first_name'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [134]:
dft

                     email     first_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [137]:
dft[['email', 'first_name']] # we have to use double brackets to access dataframe

                     email     first_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

so we have to us `[]` to create a dataframe

In [ ]:
dft[['first', 'last']] = dft['first_name'].str.split(' ', expand=True)
dft# ^             ^

                     email     first_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [ ]:
#dft.columns
# column_name = ('first', 'last')
# dft.drop(column_name, axis=1, inplace=True)
# dft
# had an error with accidentally setting up column title as tuple so had to use the code above to remove

#Index(['email', 'first_name', ('first', 'last'), 'first', 'last'], dtype='object')
#                                column name is a tuple

Index(['email', 'first_name', ('first', 'last'), 'first', 'last'], dtype='object')

                     email     first_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

long test to test